* day1
** part one
#+begin_src lisp :results output
(defparameter increments 0)
(defparameter last -1)

(with-open-file (f "./day1.input" :direction :input)
  (loop for num = (read f nil)
        while num
        if (and (> num last) (/= last -1))
          do (incf increments)
        always (setq last num)))
(format t "answer: ~a" increments)
#+end_src

#+RESULTS:
: answer: 1475

** part two
#+begin_src lisp :results output
(defparameter increments 0)
(defparameter last-nums '(0 0 0))
(defparameter sum 0)
(defparameter loop-count 0)

(with-open-file (f "./day1.input" :direction :input)
  (loop for num = (read f nil)
        while num
        do (let ((abc (- (+ sum num) (car last-nums))))
             (setq last-nums (append (cdr last-nums) (list num)))
             (if (> loop-count 2)
                 (if (< sum abc) (incf increments)))
             (setq sum abc)
             )
        always (incf loop-count)))
(format t "answer: ~a" increments)
#+end_src

#+RESULTS:
: answer: 1516

* day2
** part one
#+begin_src lisp :results output
(defparameter x 0)
(defparameter y 0)

(with-open-file (f "./day2.input" :direction :input)
  (loop for line = (read-line f nil)
        while line
        do (let* ((space-position 0)
                  (num 0))
             (progn (setq space-position (position #\Space line :start 0))
                    (setq num (parse-integer (subseq line (+ space-position 1))))
                    (cond ((search "forward" line) (setq x (+ x num)))
                          ((search "up" line) (setq y (- y num)))
                          ((search "down" line) (setq y (+ y num))))))))
(format t "answer: ~a" (* x y))
#+end_src

#+RESULTS:
: answer: 1694130

** part two
#+begin_src lisp :results output
(defparameter x 0)
(defparameter y 0)
(defparameter aim 0)

(with-open-file (f "./day2.input" :direction :input)
  (loop for line = (read-line f nil)
        while line
        do (let* ((space-position 0)
                  (num 0))
             (progn (setq space-position (position #\Space line :start 0))
                    (setq num (parse-integer (subseq line (+ space-position 1))))
                    (cond ((search "forward" line) (progn (setq x (+ x num))
                                                          (setq y (+ y (* num aim)))))
                          ((search "up" line) (setq aim (- aim num)))
                          ((search "down" line) (setq aim (+ aim num))))))))
(format t "answer: ~a" (* x y))
#+end_src

#+RESULTS:
: answer: 1698850445
